In [1]:
%%HTML
<style>
.rendered_html table, .rendered_html th, .rendered_html tr, .rendered_html td {
     font-size: 110%;
}
</style>

# Analiza i bazy danych

## Obróbka danych w pakiecie pandas

### dr hab. inż. Jerzy Baranowski, Prof. AGH

# pandas - Python DAta ANalisyS library
![](img/pandas.svg)

# Konstrukcja

pandas opiera się o pakiety **Numpy** i **Matplotlib**

# Przykładowy zbiór danych

| Name     | Breed        | Color  | Height (cm)  | Weight (kg)  | Date of Birth  |
|----------|--------------|--------|--------------|--------------|----------------|
| Bella    | Labrador     | Brown  | 56           | 25           | 01.07.2013     |
| Charlie  | Poodle       | Black  | 43           | 23           | 16.09.2016     |
| Lucy     | Chow Chow    | Brown  | 46           | 22           | 25.08.2014     |
| Cooper   | Schnauzer    | Gray   | 49           | 17           | 11.12.2011     |
| Max      | Labrador     | Black  | 59           | 29           | 20.01.2017     |
| Stella   | Chihuahua    | Tan    | 18           | 2            | 20.04.2015     |
| Bernie   | St. Bernard  | White  | 77           | 74           | 27.02.2018     |

# Data frame

- Podstawowy obiekt w analizie danych
- Występuje w wielu językach i wielu formach:
    - np. w R ```data frame```, ```tibble```, ```data_table```
    - w Pythonie pandas ```DataFrame```
    - w Julii ```DataFrames.jl```

# Data frame
- reprezentacja tabeli
- zbiór metod, które pozwalają na jej obsługę
- indeksowana

In [2]:
import pandas as pd
dogs = pd.read_csv('dogs_clean.csv')

In [3]:
print(dogs)

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
4      Max     Labrador  Black         59.0         29.0    2017-01-20
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [4]:
dogs.head()

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella   Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie     Poodle  Black         43.0         23.0    2016-09-16
2     Lucy  Chow Chow  Brown         46.0         22.0    2014-08-25
3   Cooper  Schnauzer   Gray         49.0         17.0    2011-11-12
4      Max   Labrador  Black         59.0         29.0    2017-01-20

In [5]:
dogs.tail()

     Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
2    Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
3  Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
4     Max     Labrador  Black         59.0         29.0    2017-01-20
5  Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6  Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [6]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (cm)    7 non-null      float64
 4   Weight (kg)    7 non-null      float64
 5   Date of Birth  7 non-null      object
dtypes: float64(2), object(4)
memory usage: 464.0+ bytes

In [7]:
dogs.shape

(7, 6)

In [8]:
dogs.describe()

       Height (cm)  Weight (kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

In [9]:
dogs.describe(include='all')

          Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
count        7         7      7     7.000000     7.000000             7
unique       7         6      5          NaN          NaN             7
top     Stella  Labrador  Black          NaN          NaN    2018-02-27
freq         1         2      2          NaN          NaN             1
mean       NaN       NaN    NaN    49.714286    27.428571           NaN
std        NaN       NaN    NaN    17.960274    22.292429           NaN
min        NaN       NaN    NaN    18.000000     2.000000           NaN
25%        NaN       NaN    NaN    44.500000    19.500000           NaN
50%        NaN       NaN    NaN    49.000000    23.000000           NaN
75%        NaN       NaN    NaN    57.500000    27.000000           NaN
max        NaN       NaN    NaN    77.000000    74.000000           NaN

In [10]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56.0, 25.0, '2013-01-07'],
       ['Charlie', 'Poodle', 'Black', 43.0, 23.0, '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Brown', 46.0, 22.0, '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gray', 49.0, 17.0, '2011-11-12'],
       ['Max', 'Labrador', 'Black', 59.0, 29.0, '2017-01-20'],
       ['Stella', 'Chihuahua', 'Tan', 18.0, 2.0, '2015-04-20'],
       ['Bernie', 'St. Bernard', 'White', 77.0, 74.0, '2018-02-27']],
      dtype=object)

In [11]:
dogs.columns

Index(['Name', 'Breed', 'Color', 'Height (cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')

In [12]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

In [13]:
type(dogs)

pandas.core.frame.DataFrame

### Wyciąganie danych z data frame'ów

In [14]:
dogs['Breed']

0       Labrador
1         Poodle
2      Chow Chow
3      Schnauzer
4       Labrador
5      Chihuahua
6    St. Bernard
Name: Breed, dtype: object

In [15]:
dogs.Breed

0       Labrador
1         Poodle
2      Chow Chow
3      Schnauzer
4       Labrador
5      Chihuahua
6    St. Bernard
Name: Breed, dtype: object

Problem jak jest spacja

In [16]:
dogs['Weight (kg)']

0    25.0
1    23.0
2    22.0
3    17.0
4    29.0
5     2.0
6    74.0
Name: Weight (kg), dtype: float64

Można więcej kolumn

In [17]:
dogs[["Breed", "Height (cm)"]]

         Breed  Height (cm)
0     Labrador         56.0
1       Poodle         43.0
2    Chow Chow         46.0
3    Schnauzer         49.0
4     Labrador         59.0
5    Chihuahua         18.0
6  St. Bernard         77.0

In [18]:
lista=["Breed", "Height (cm)"]
dogs[lista]

         Breed  Height (cm)
0     Labrador         56.0
1       Poodle         43.0
2    Chow Chow         46.0
3    Schnauzer         49.0
4     Labrador         59.0
5    Chihuahua         18.0
6  St. Bernard         77.0

### Filtrowanie

In [19]:
dogs['Weight (kg)']>20

0     True
1     True
2     True
3    False
4     True
5    False
6     True
Name: Weight (kg), dtype: bool

In [20]:
dogs[dogs['Weight (kg)']>20]

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
4      Max     Labrador  Black         59.0         29.0    2017-01-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [21]:
dogs[dogs['Date of Birth']> "2015-01-01"]

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
4      Max     Labrador  Black         59.0         29.0    2017-01-20
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [22]:
dogs[dogs["Breed"] == "Labrador"]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07
4    Max  Labrador  Black         59.0         29.0    2017-01-20

### Łączenie warunków

In [23]:
is_lab = dogs["Breed"] == "Labrador" 
is_brown = dogs["Color"] == "Brown"
dogs[is_lab & is_brown]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07

In [24]:
dogs[(dogs["Breed"] == "Labrador" )&(dogs["Color"] == "Brown")]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07

# Analiza i bazy danych

## Obróbka danych w pakiecie pandas

### dr hab. inż. Jerzy Baranowski, Prof. AGH

### Sortowanie

In [25]:
dogs.sort_values('Breed')

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
4      Max     Labrador  Black         59.0         29.0    2017-01-20
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [26]:
dogs.sort_values(['Color','Breed'])

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
4      Max     Labrador  Black         59.0         29.0    2017-01-20
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

## Struktury danych w pandas
### Podstawowe elementy
 - index - ciągi etykiet
 - Series - tablica jednowymiarowa z indeksem
 - DataFrame - tablica dwuwymiarowa z szeregami jako kolumnami
 
### Indeksy
 - Immutable
 - Jednorodne w typie danych

## Tworzenie szeregu

In [27]:
prices = [10.70, 10.86, 10.74, 10.71, 10.79] 
shares = pd.Series(prices)
print(shares)

0    10.70
1    10.86
2    10.74
3    10.71
4    10.79
dtype: float64

## Tworzenie indeksu

In [28]:
days = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri'] 
shares = pd.Series(prices, index=days)
print(shares)

Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

## Zmiana nazwy indeksu

In [29]:
shares.index.name = 'weekday'
print(shares)

weekday
Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

## Zmiana wszystkich elementów indeksu

In [30]:
shares.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
print(shares)

Monday       10.70
Tuesday      10.86
Wednesday    10.74
Thursday     10.71
Friday       10.79
dtype: float64

In [31]:
dogs.index=dogs.Name
dogs.head()

            Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Bella      Bella   Labrador  Brown         56.0         25.0    2013-01-07
Charlie  Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy        Lucy  Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper    Cooper  Schnauzer   Gray         49.0         17.0    2011-11-12
Max          Max   Labrador  Black         59.0         29.0    2017-01-20

In [32]:
dogs.drop('Name',axis=1,inplace=True) 
dogs.head()

             Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Bella     Labrador  Brown         56.0         25.0    2013-01-07
Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy     Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper   Schnauzer   Gray         49.0         17.0    2011-11-12
Max       Labrador  Black         59.0         29.0    2017-01-20

##  .loc

In [33]:
dogs.loc['Bella']

Breed              Labrador
Color                 Brown
Height (cm)            56.0
Weight (kg)            25.0
Date of Birth    2013-01-07
Name: Bella, dtype: object

In [34]:
dogs.loc['Charlie':'Cooper']

             Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy     Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper   Schnauzer   Gray         49.0         17.0    2011-11-12

In [35]:
dogs.loc['Charlie':'Cooper','Breed']

Name
Charlie       Poodle
Lucy       Chow Chow
Cooper     Schnauzer
Name: Breed, dtype: object

In [36]:
dogs.loc['Charlie':'Cooper','Height (cm)':'Weight (kg)']

         Height (cm)  Weight (kg)
Name
Charlie         43.0         23.0
Lucy            46.0         22.0
Cooper          49.0         17.0

## .iloc

In [37]:
dogs.iloc[0]

Breed              Labrador
Color                 Brown
Height (cm)            56.0
Weight (kg)            25.0
Date of Birth    2013-01-07
Name: Bella, dtype: object

In [38]:
dogs.iloc[0, [1,2,4]]

Color                 Brown
Height (cm)            56.0
Date of Birth    2013-01-07
Name: Bella, dtype: object

## Grupowanie danych

In [39]:
sales = pd.DataFrame( {
 'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
 'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
 'bread': [139, 237, 326, 456],
 'butter': [20, 45, 70, 98]
} )
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [40]:
sales.loc[sales['weekday'] == 'Sun'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

In [41]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

## Działanie groupby
 - sales.groupby('weekday').count() 
     - dzieli po ‘weekday’
     - stosuje funkcję count() na każdej grupie
     - łączy elementy w grupach
 - musimy zastosować funkcję agregującą np. 
     - mean()
     - std()
     - sum() 
     - first(), last()
     - min(), max()

In [42]:
sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [43]:
## można wiele kolumn
sales.groupby('weekday')[['bread','butter']].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

In [44]:
## lub stworzyć wielopoziomowy indeks
sales.groupby(['city','weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [45]:
## lub wiele agregacji
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

In [46]:
## lub własne funkcje agregujące
def data_range(series):
    return series.max() - series.min()
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

## Przestawianie

In [47]:
sales.pivot(index = 'city', columns = 'weekday', values='bread'  )

weekday  Mon  Sun
city
Austin   326  139
Dallas   456  237

## Tabela przestawna

In [48]:
import numpy as np
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [49]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [50]:
table = pd.pivot_table(df, values='D', index=['A'],
                    columns=['C'], aggfunc=np.sum)
table

C    large  small
A
bar     11     11
foo      4      7

In [51]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [52]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

## Melt - zamiana szerokich tabel na wąskie

In [53]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})

In [54]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [55]:
df.melt()

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

## Istotne kwargi

- ```id_vars``` zmienne identyfikujące
- ```value_vars``` wartości do rozprowadzenia
- ```var_name``` nazwa kolumny określającej zmienne
- ```value_name``` nazwa kolumny z wartościami

In [56]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [57]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [58]:
pd.melt(df, id_vars=['A'], value_vars=['B'],
        var_name='myVarname', value_name='myValname')

   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5

## Inne metody o zbliżonych zastosowaniach
- ```pd.wide_to_long()```
- ```df.explode()```

## Wierzchołek góry lodowej
- multi indeksy (we własnym zakresie)
- datetime (przy szeregach czasowych)
- wizualizacja (przy EDA)

# Analiza i bazy danych

## Czyszczenie danych

### dr hab. inż. Jerzy Baranowski, Prof. AGH

## Tidy to nie wszystko

- format Tidy jest już do względnie przyzwoitych danych
- transformacja do formatu Tidy jest odwracalna
- często dane są w postaci, która wymaga nieodwracalnych przekształceń

## Śmieci przy imporcie
- zabłąkane spacje
- kodowania
- nierówne kolumny
- egzotyczne formaty

## Kompletność

- w danych czasem brakuje wartości
- przyczyna 
    - nigdy jej tam nie było, dlaczego?
    - artefakty
- kodowanie brakujących wartości

## W jaki sposób brakuje?

- Cały wiersz/cała kolumna ?
- Wymieszane

## Co zrobić z brakującymi danymi?

- wyrzucić ?
- imputować ?
- czy brak informacji też jest informacją?

## Różnice w brakowaniu danych
 
- całkowicie losowo
- losowo
- zależnie od nieobserwowalnych predyktorów
- zależnie od brakującej wartości

## Imputacja 

- wprowadzenie nowych wartości w miejsce brakujących w jakiś sposób
    - średnia
    - mediana
    - poprzednia wartość
    - itp.
- modelowanie 
    - rozkład pozostałych wartości
    - obserwowane czynniki
    - wiedza ekspercka
- zaawansowane algorytmy

## Poprawność danych - spełnianie ograniczeń
- typy danych
- zakresy
- wymogi zewnętrzne
- unikalność
- przynależność do zbioru
- wyrażenia regularne
- spójność między kolumnami

## Dokładność
- zgodność ze stanem faktycznym
- np. czy kod pocztowy zgadza się z adresem
- czy nazwa produktu zgadza się z producentem
- wymaga walidacji zewnętrznym źródłe danych

## Spójność
- unikanie wewnętrznych sprzecznośći
- kolizje danych nieaktualnych z aktualnymi
- sprzeczność ze stanem faktycznym

## Jednorodność
- spójność jednostek i zakresów
- różne kodowania tych samych wartości

## Przykład 1 - pieski

In [59]:
with open('dogs.csv','r') as f:
    for line in f.readlines():
        print(line)

﻿Name ;Breed ;Color ;Height (cm) ;Weight (kg) ;Date of Birth

;;;;;

Bella ;Labrador ;Brown ;56;25;01.07.2013

;;;;;

Charlie ;Poodle ;Black ;43;23;16.09.2016

;;;;;

Lucy ;Chow Chow ;Brown ;46;22;25.08.2014

;;;;;

Cooper ;Schnauzer ;Gray ;49;17;11.12.2011

;;;;;

Max ;Labrador ;Black ;59;29;20.01.2017

;;;;;

Stella ;Chihuahua ;Tan ;18;2;20.04.2015

;;;;;

Bernie ;St. Bernard ;White ;77;74;27.02.2018

;;;;;

In [60]:
import pandas as pd
dogs = pd.read_csv('dogs.csv',sep=';')
dogs

       Name         Breed   Color   Height (cm)   Weight (kg)  Date of Birth
0        NaN           NaN     NaN           NaN           NaN            NaN
1     Bella      Labrador   Brown           56.0          25.0     01.07.2013
2        NaN           NaN     NaN           NaN           NaN            NaN
3   Charlie        Poodle   Black           43.0          23.0     16.09.2016
4        NaN           NaN     NaN           NaN           NaN            NaN
5      Lucy     Chow Chow   Brown           46.0          22.0     25.08.2014
6        NaN           NaN     NaN           NaN           NaN            NaN
7    Cooper     Schnauzer    Gray           49.0          17.0     11.12.2011
8        NaN           NaN     NaN           NaN           NaN            NaN
9       Max      Labrador   Black           59.0          29.0     20.01.2017
10       NaN           NaN     NaN           NaN           NaN            NaN
11   Stella     Chihuahua     Tan           18.0           2.0     20.04.2015
12       NaN           NaN     NaN           NaN           NaN            NaN
13   Bernie   St. Bernard   White           77.0          74.0     27.02.2018
14       NaN           NaN     NaN           NaN           NaN            NaN

In [61]:
dogs.columns=dogs.columns.str.rstrip()
dogs.Name=dogs.Name.str.rstrip()
dogs.Breed=dogs.Breed.str.rstrip()
dogs.Color=dogs.Color.str.rstrip()
dogs.dropna(inplace=True)
dogs.reset_index(inplace=True)


dogs

   index     Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0      1    Bella     Labrador  Brown         56.0         25.0    01.07.2013
1      3  Charlie       Poodle  Black         43.0         23.0    16.09.2016
2      5     Lucy    Chow Chow  Brown         46.0         22.0    25.08.2014
3      7   Cooper    Schnauzer   Gray         49.0         17.0    11.12.2011
4      9      Max     Labrador  Black         59.0         29.0    20.01.2017
5     11   Stella    Chihuahua    Tan         18.0          2.0    20.04.2015
6     13   Bernie  St. Bernard  White         77.0         74.0    27.02.2018

In [62]:
dogs['Date of Birth']=pd.to_datetime(dogs['Date of Birth'])
dogs.drop('index',axis=1,inplace=True)
dogs.to_csv('dogs_clean.csv',index=False)
dogs

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
4      Max     Labrador  Black         59.0         29.0    2017-01-20
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

## Przykład 2 - nowotwór nerki

In [63]:
states_dict = {
        'AK': 'Alaska',
        'AL': 'Alabama',
        'AR': 'Arkansas',
        'AS': 'American Samoa',
        'AZ': 'Arizona',
        'CA': 'California',
        'CO': 'Colorado',
        'CT': 'Connecticut',
        'DC': 'District of Columbia',
        'DE': 'Delaware',
        'FL': 'Florida',
        'GA': 'Georgia',
        'GU': 'Guam',
        'HI': 'Hawaii',
        'IA': 'Iowa',
        'ID': 'Idaho',
        'IL': 'Illinois',
        'IN': 'Indiana',
        'KS': 'Kansas',
        'KY': 'Kentucky',
        'LA': 'Louisiana',
        'MA': 'Massachusetts',
        'MD': 'Maryland',
        'ME': 'Maine',
        'MI': 'Michigan',
        'MN': 'Minnesota',
        'MO': 'Missouri',
        'MP': 'Northern Mariana Islands',
        'MS': 'Mississippi',
        'MT': 'Montana',
        'NA': 'National',
        'NC': 'North Carolina',
        'ND': 'North Dakota',
        'NE': 'Nebraska',
        'NH': 'New Hampshire',
        'NJ': 'New Jersey',
        'NM': 'New Mexico',
        'NV': 'Nevada',
        'NY': 'New York',
        'OH': 'Ohio',
        'OK': 'Oklahoma',
        'OR': 'Oregon',
        'PA': 'Pennsylvania',
        'PR': 'Puerto Rico',
        'RI': 'Rhode Island',
        'SC': 'South Carolina',
        'SD': 'South Dakota',
        'TN': 'Tennessee',
        'TX': 'Texas',
        'UT': 'Utah',
        'VA': 'Virginia',
        'VI': 'Virgin Islands',
        'VT': 'Vermont',
        'WA': 'Washington',
        'WI': 'Wisconsin',
        'WV': 'West Virginia',
        'WY': 'Wyoming'
}

In [64]:
states_dict2 = {state: abbrev for abbrev, state in states_dict.items()}

In [65]:

def count_unique_index(df, by, asc=False):
    """ Count combinations of column values
    df - dataframe to be processed
    by - list of columns to be checked
    asc - is sorted list should be ascending (default false) 
    
    Returns - dataframe of column combinations and their counts 
    """
    return df.groupby(by).size().reset_index().rename(columns={0:'count'}).sort_values('count',ascending=asc)

In [66]:
with open('cntypop.txt','r') as f:
    lista = (f.readlines())
    for line in lista[:2]:
        print(line)

stf	 ctyf	countyNm	 stateAb	 totPop	 hHolds	 land	 lat	 lon

1	100	Autauga            	AL	34222	12732	1543666	32542207	-86641472

In [67]:
df_1=pd.read_table('cntypop.txt')
df_1.head()

,stf,ctyf,countyNm,stateAb,totPop,hHolds,land,lat,lon
0,1,100,Autauga,AL,34222,12732,1543666,32542207,-86641472
1,1,300,Baldwin,AL,98280,50933,4135016,30654881,-87754736
2,1,500,Barbour,AL,25417,10705,2292133,31863073,-85388993
3,1,700,Bibb,AL,16576,6404,1611914,32996943,-87126855
4,1,900,Blount,AL,39248,15790,1672287,33979740,-86566214

In [80]:
duplicates = count_unique_index(df_1, ['countyNm', ' stateAb'], asc=False)
duplicates[duplicates.iloc[:,-1]>1]

                        countyNm  stateAb  count
2451         San Juan                  WA      3
678          Currituck                 NC      3
2073         Okaloosa                  FL      2
986          Galveston                 TX      2
2609  St. Martin Parish                LA      2
2208         Pierce                    WA      2
2            Accomack                  VA      2

In [81]:
counties=df_1.loc[:,'countyNm':' totPop'] # limit to  3 columns
counties.countyNm=counties.countyNm.str.capitalize().str.rstrip() # capitalize and remove trailing spaces
counties['population']=counties.groupby(['countyNm', ' stateAb'])[' totPop'].transform(sum) #sum repearted instances of county-state
counties.head()

  countyNm  stateAb   totPop  population
0  Autauga       AL    34222       34222
1  Baldwin       AL    98280       98280
2  Barbour       AL    25417       25417
3     Bibb       AL    16576       16576
4   Blount       AL    39248       39248

In [82]:
counties=(counties.drop_duplicates(subset=['countyNm', ' stateAb']) # drop transformed duplicates
                 .drop([' totPop'],axis='columns') # drop old population
                 .reset_index(drop=True) # reset index
                 [['countyNm', ' stateAb','population']])# reorder columns
counties.columns=['county','state','population'] #rename columns
counties.head()

    county state  population
0  Autauga    AL       34222
1  Baldwin    AL       98280
2  Barbour    AL       25417
3     Bibb    AL       16576
4   Blount    AL       39248

In [71]:
with open('gd80to84.txt','r') as f:
    lista = (f.readlines())
    for line in lista[:2]:
        print(line)

state		county		dc	dcV	pop	popV	aadc	aadcV		dcC	dcCV		good

ALABAMA	AUTAUGA	2	VALID	61921	VALID	3.3	UNRELIABLE	3.2	UNRELIABLE	1

In [72]:
df_2=pd.read_table('gd80to84.txt')


df_2.head()

,state,Unnamed: 1,county,Unnamed: 3,dc,dcV,pop,popV,aadc,aadcV,Unnamed: 10,dcC,dcCV,Unnamed: 13,good
0,ALABAMA,AUTAUGA,2.0,VALID,61921.0,VALID,3.3,UNRELIABLE,3.2,UNRELIABLE,1,NaN,NaN,NaN,NaN
1,ALABAMA,BALDWIN,7.0,VALID,170945.0,VALID,3.5,UNRELIABLE,4.1,UNRELIABLE,1,NaN,NaN,NaN,NaN
2,ALABAMA,BARBOUR,0.0,VALID,33316.0,VALID,0.0,UNRELIABLE,0.0,UNRELIABLE,1,NaN,NaN,NaN,NaN
3,ALABAMA,BIBB,0.0,VALID,30152.0,VALID,0.0,UNRELIABLE,0.0,UNRELIABLE,1,NaN,NaN,NaN,NaN
4,ALABAMA,BLOUNT,3.0,VALID,88342.0,VALID,3.2,UNRELIABLE,3.4,UNRELIABLE,1,NaN,NaN,NaN,NaN

In [73]:
df_2_tr=df_2.iloc[:,:-4]
df_2_tr.columns=['state',  'county',  'dc', 'dcV', 'pop','popV', 'aadc', 'aadcV',  'dcC', 'dcCV','good']
df_2_tr.head()

,state,county,dc,dcV,pop,popV,aadc,aadcV,dcC,dcCV,good
0,ALABAMA,AUTAUGA,2.0,VALID,61921.0,VALID,3.3,UNRELIABLE,3.2,UNRELIABLE,1
1,ALABAMA,BALDWIN,7.0,VALID,170945.0,VALID,3.5,UNRELIABLE,4.1,UNRELIABLE,1
2,ALABAMA,BARBOUR,0.0,VALID,33316.0,VALID,0.0,UNRELIABLE,0.0,UNRELIABLE,1
3,ALABAMA,BIBB,0.0,VALID,30152.0,VALID,0.0,UNRELIABLE,0.0,UNRELIABLE,1
4,ALABAMA,BLOUNT,3.0,VALID,88342.0,VALID,3.2,UNRELIABLE,3.4,UNRELIABLE,1

In [74]:
with open('gd85to89.txt','r') as f:
    lista = (f.readlines())
    for line in lista[:2]:
        print(line)

state	county	dc	dcV	pop	popV	aadc	aadcV	dcC	dcCV	good

ALABAMA	AUTAUGA	1	VALID	64915	VALID	1.7	UNRELIABLE	1.5	UNRELIABLE	1

In [75]:

df_3=pd.read_table('gd85to89.txt')
df_3.head()

,state,county,dc,dcV,pop,popV,aadc,aadcV,dcC,dcCV,good
0,ALABAMA,AUTAUGA,1.0,VALID,64915.0,VALID,1.7,UNRELIABLE,1.5,UNRELIABLE,1
1,ALABAMA,BALDWIN,15.0,VALID,195253.0,VALID,6.3,UNRELIABLE,7.7,UNRELIABLE,1
2,ALABAMA,BARBOUR,1.0,VALID,33987.0,VALID,2.6,UNRELIABLE,2.9,UNRELIABLE,1
3,ALABAMA,BIBB,1.0,VALID,31175.0,VALID,2.9,UNRELIABLE,3.2,UNRELIABLE,1
4,ALABAMA,BLOUNT,5.0,VALID,91547.0,VALID,4.8,UNRELIABLE,5.5,UNRELIABLE,1

In [76]:
death_counts_decade=df_3.iloc[:,0:3] # limit to first 3 columns
death_counts_decade=death_counts_decade.dropna() #remove empty rows
death_counts_decade.dc=death_counts_decade.dc+df_2_tr.dc # sum death counts for both 5 years
death_counts_decade.county=death_counts_decade.county.str.capitalize() # capitalize
death_counts_decade.state=death_counts_decade.state.str.capitalize().map(states_dict2) #mapr state name to abbreviation
death_counts_decade.head()

  state   county    dc
0    AL  Autauga   3.0
1    AL  Baldwin  22.0
2    AL  Barbour   1.0
3    AL     Bibb   1.0
4    AL   Blount   8.0

In [77]:
# merging population and death data
counties_dc=counties.merge(death_counts_decade,on=['state','county'],how='left')[['county', 'state','population', 'dc']]
counties_dc.dc=counties_dc.dc.fillna(0) # missing county-state combinations filled with 0's

In [78]:
counties_dc.head()

    county state  population    dc
0  Autauga    AL       34222   3.0
1  Baldwin    AL       98280  22.0
2  Barbour    AL       25417   1.0
3     Bibb    AL       16576   1.0
4   Blount    AL       39248   8.0

In [79]:
counties_dc.to_csv('counties_dc.csv')

# Analiza i bazy danych

## Źródła danych

### dr hab. inż. Jerzy Baranowski, Prof. AGH

## Pliki tekstowe (flat files)

- lekkie łatwe i przyjemne
- chyba, że akurat nie
- kodowanie
- separatory
- daty

## Arkusze kalkulacyjne (głównie excel)
- w gruncie rzeczy xml
- problemy z tym co excel zepsuł
- dane w formie kolorków i czcionek

## Specyficzne formaty

- Matlab, R
- SAS, STATA 
- HDF5

## JSON
- JavaScript Object Notation

```json
{
  "menu": {
    "id": "file",
    "value": "File",
    "popup": {
      "menuitem": [
        {"value": "New", "onclick": "CreateNewDoc()"},
        {"value": "Open", "onclick": "OpenDoc()"},
        {"value": "Close", "onclick": "CloseDoc()"}
      ]
    }
  }
}
```

## Różne API
- często json
- czasem goły tekst

## Webscrapping
- wyrażenia regularne
- niekoniecznie zgodne z licencją
- obsługa html

## Bazy danych

- bezpośrednio
- przez pliki
- ORM (Object Relational-Mapping)